// ============================================================
// ЗАДАЧА 3: Чётное или нечётное
// Что учим: TryParse, логические операторы (%), if/else, циклы
// ============================================================
// Пользователь вводит 5 чисел подряд.
// Для каждого программа говорит: чётное или нечётное.
// В конце выводит сколько было чётных и сколько нечётных.

Console.WriteLine("Задача 3.");