// ============================================================
// ЗАДАЧА 2: Простой калькулятор
// Что учим: switch, TryParse, условия (if/else)
// ============================================================
// Пользователь вводит первое число, знак операции (+, -, *, /),
// потом второе число. Программа выводит результат.
// Деление на ноль обработать отдельно.

Console.WriteLine("Задача 2.");